Revit 2027 API
ViewCropRegionShapeManager.Split Property
 Whether or not the view crop is split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Split { get; }
Public ReadOnly Property Split As Boolean
	Get
public:
property bool Split {
	bool get ();
}
member Split : bool with get
Property Value
Boolean
Remarks
 This property reflects the actual visual split of the crop region. Thus, if the view has non-rectangular crop shape set, this property is false.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace